tsung/event_planner.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='30000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host=" wywb-wopagination.mui3yzewey.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="6" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="14" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="18" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="22" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="26" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="30" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="9" duration="30" unit="second">
      <users arrivalrate="34" unit="second"></users>
    </arrivalphase>
     <arrivalphase phase="10" duration="30" unit="second">
      <users arrivalrate="38" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      
      <setdynvars sourcetype="random_number" start="1" end="10000">
        <var name="num"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="1" end="99">
        <var name="userrand"/>
      </setdynvars>
      
     <transaction name="LOGIN">
       <request subst="true">
         <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
          <http url="/login" method="POST" version="1.1" contents="session[email]=example-%%_userrand%%@railstutorial.org&amp;
           session[password]=password&amp;" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
      
      <transaction name="CREATE_LOCATION">
        <request subst="true">
          <dyn_variable name="locationid" re="Location: .*/locations/([0-9]+)"></dyn_variable>
          <http url="/locations" method="POST" version="1.1" contents="location[name]=UCSB%%_num%%&amp;location[city]=Santa Barbara&amp;location[capacity]=
          100&amp;location[email]=ucsb%%_num%%@test.com&amp;location[phone]=1234567890&amp;commit=Create Location"
            content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>

      <transaction name="CREATE_TAG">
        <request subst="true">
          <dyn_variable name="tagid" re="Location: .*/tags/([0-9]+)"></dyn_variable>
          <http url="/tags" method="POST" version="1.1" contents="tag[name]=fun-event%%_num%%&amp;tag[description]=This is a fun event&amp;
          commit=Create Tag" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
      
      <transaction name="CREATE_EVENT">
        <request subst="true">
          <http url="/events" method="POST" version="1.1" contents="event[title]=Goblet of Fire%%_num%%&amp;event[tag_id]=%%_tagid%%&amp;
          event[location_id]=%%_locationid%%&amp;event[price]=20&amp;event[date(1i)]=2019&amp;event[date(2i)]=1&amp;event[date(3i)]=9&amp;event[date(4i)]=05&amp;
          event[date(5i)]=09&amp;event[user_id]=%%_userid%%&amp;commit=Create Event"
            content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
  
      <transaction name="LOGOUT">
        <request subst="true">
          <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
      
    </session>
  </sessions>
</tsung>